Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.c
static const libmem_ext_driver_functions_t ext_driver_functions =
{
	0,
	libmem_Read,
	libmem_CRC32
};

#if defined FSL_FEATURE_SOC_CCM_ANALOG_COUNT && FSL_FEATURE_SOC_CCM_ANALOG_COUNT > 0
void SetClockConfig (FLEXSPI_Type *base, uint32_t div)
{
	switch ((uint32_t)base)
	{
		case FLEXSPI_BASE:
			CLOCK_EnableClock(kCLOCK_FlexSpi);
			CLOCK_SetMux     (kCLOCK_FlexspiMux, 0x2); // Choose PLL2 PFD2 clock as flexspi source clock.
			CLOCK_SetDiv     (kCLOCK_FlexspiDiv, div-1);
			break;
		#ifdef FLEXSPI2
		case FLEXSPI2_BASE:
			CLOCK_EnableClock(kCLOCK_FlexSpi2);
			CLOCK_SetMux     (kCLOCK_Flexspi2Mux, 0x0); // Choose PLL2 PFD2 clock as flexspi2 source clock.
			CLOCK_SetDiv     (kCLOCK_Flexspi2Div, div-1);
			break;
		#endif
		default:
			break;
	}
}
#endif


/** Libmem_InitializeDriver_xSPI:
Initialize the FlexSPI Interface for using as a SPI-Interface
@param FlashHandle The handle which should be initialized
@param base The Flex-SPI-base to use
@param MemType The Type of SPI-Interface to use if possible
@return LibmemStatus_t LibmemStaus_Success if the operation was successfully */
LibmemStatus_t Libmem_InitializeDriver_xSPI (libmem_driver_handle_t *FlashHandle, FLEXSPI_Type *base, enum eMemoryType MemType)
{
	// Set up source clock
	CLOCK_InitSysPfd (kCLOCK_Pfd2, 16);        // Set PLL2 PFD2 clock 594 MHZ.
	uint32_t SourceClock_Hz = CLOCK_GetSysPfdFreq (kCLOCK_Pfd2);

	uint32_t FlexSPI_ClockDiv = 6;
	uint32_t FlexSPI_Clock_Hz = SourceClock_Hz / FlexSPI_ClockDiv;
	SetClockConfig (base, FlexSPI_ClockDiv);	// flexspi clock 99 MHz.
	deviceconfig.flexspiRootClk = FlexSPI_Clock_Hz;

	// Get FLEXSPI default settings and configure the FlexSPI.
	flexspi_config_t config;
	FLEXSPI_GetDefaultConfig (&config);

	// Need to set the combination-enable option. This options combines 8 data lines from FlexSPI channel A with
	// 4 data lines from FlexSPI channel B to form an 8-line bus for octal. On this SoC this is the only way to enable octal.
	config.enableCombination              = (MemType == MemType_OctaSPI_DDR || MemType == MemType_OctaSPI);	// Only true when using Octa-Mode
	config.ahbConfig.enableAHBPrefetch    = true;	// Enable AHB prefetching
	config.ahbConfig.enableAHBBufferable  = true;
	config.ahbConfig.enableReadAddressOpt = true;
	config.ahbConfig.enableAHBCachable    = true;
	config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;	// To achieve high speeds - always use DQS
	FLEXSPI_Init           (base, &config);
	FLEXSPI_SetFlashConfig (base, &deviceconfig, kFLEXSPI_PortA1);	// Configure flash settings according to serial flash feature.
	FLEXSPI_UpdateLUT      (base, 0, LUT_SPI, CUSTOM_LUT_LENGTH);	// Update LUT table
	FLEXSPI_SoftwareReset  (base);									// Do software reset.


	struct DeviceInfo Info;
	status_t status = ReadJEDEC (base, &Info);
	if (status != kStatus_Success)
		return LibmemStaus_InvalidDevice;

	// Check for the Manufacture-ID and adapt the Configuration
	const uint32_t *lut = NULL;
	if (Info.ManufactureID == ManufactureID_AdestoTechnologies)
	{
		DebugPrint ("Found Adesto Flash\r\n");
		// Unlock all sectors
		UnprotectAll_Adesto (base);

		// Switch the configuration according to the configured memory-type
		uint8_t Status = 0;
		switch (MemType)
		{
			case MemType_OctaSPI_DDR:
				// Enter Octal-Mode with DDR.
				Status = 0x88;
				lut = LUT_OctaSPI_DDR;
				break;
			case MemType_OctaSPI:
				Status = 0x08;
				lut = LUT_OctaSPI;
				break;
			case MemType_QuadSPI_DDR:
				Status = 0x84;
				lut = LUT_QuadSPI_DDR;
				break;
			case MemType_QuadSPI:
				Status = 0x04;
				lut = LUT_QuadSPI;
				break;
			case MemType_SPI:
				// don't update the LUT, we are already in SPI-mode
				Status = 0x00;
				break;
			default:
				return LIBMEM_STATUS_ERROR;
		}

		// send write-enable 
		status_t stat = WriteEnable (base, 0);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;

		// Write to status/control register 2 to switch to chosen memory-Type
		stat = WriteRegister (base, 2, Status, LUT_WriteStatusReg_Adesto);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;

		stat = EnterQuadSPIMode (base, 0, LUT_EnterQPI);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;
	}
	else if (Info.ManufactureID == ManufactureID_Atmel)
	{
		DebugPrint ("Found Atmel Flash\r\n");
		status_t stat = EnterQuadSPIMode (base, 0, LUT_EnterQPI_Atmel);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;
		lut = LUT_QuadSPI_3;
	}
	else if (Info.ManufactureID == ManufactureID_Nexcom)	// Winbond
	{
		DebugPrint ("Found Nexcom Flash\r\n");
		// send write-enable 
		status_t stat = WriteEnable (base, 0);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;

		// Write to status/control register 2 to switch to enter quad-Mode
		stat = WriteRegister (base, 0, 2, LUT_WriteConfigReg_Winbond);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;

		lut = LUT_QuadSPI_3;
	}
	else if (Info.ManufactureID == ManufactureID_Macronix)
	{
		DebugPrint ("Found Macronix Flash\r\n");
		uint8_t Status = 0;
		switch (MemType)
		{
			case MemType_OctaSPI_DDR:
				// Enter Octal-Mode with DDR.
				Status = 2;
				lut = LUT_OctaSPI_DDR_2;
				break;
			case MemType_OctaSPI:
				Status = 1;
//				lut = LUT_OctaSPI;
				break;
//			case MemType_QuadSPI_DDR:
//				Status = 0x84;
//				lut = LUT_QuadSPI_DDR;
//				break;
//			case MemType_QuadSPI:
//				Status = 0x04;
//				lut = LUT_QuadSPI;
				break;
			case MemType_SPI:
				// don't update the LUT, we are already in SPI-mode
				Status = 0x00;
				break;
			default:
				return LIBMEM_STATUS_ERROR;
		}

		// send write-enable 
		status_t stat = WriteEnable (base, 0);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;
		// Write to status/control register 2 to switch to chosen memory-Type
		stat = WriteRegister (base, 0, Status, LUT_WriteConfigReg_Macronix);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;
	}
	else if (Info.ManufactureID == ManufactureID_Lucent)
	{
		DebugPrint ("Found Lucent Flash\r\n");
		status_t stat = EnterQuadSPIMode (base, 0, LUT_EnterQPI_ISSI);
		if (stat != kStatus_Success)
			return LIBMEM_STATUS_ERROR;

		lut = LUT_QuadSPI_2;
	}
	else
	{
		DebugPrint ("unknown Flash-memory\r\n");
		return LibmemStaus_InvalidDevice;
	}

	// Use the size information from the JEDEC-Information to configure the Interface
	uint32_t FlashSize = CalculateCapacity_KBytes (Info.Capacity);
	deviceconfig.flashSize = FlashSize;
	geometry[0].count = FlashSize / (4096 / 1024);
	FlashSize *= 1024;	// Convert kBytes to bytes
	FLEXSPI_SetFlashConfig (base, &deviceconfig, kFLEXSPI_PortA1);	// Configure flash settings according to serial flash feature.

	// Reconfigure the Interface according to the gathered Flash-Information and configuration
	if (MemType == MemType_OctaSPI_DDR || MemType == MemType_QuadSPI_DDR)
	{
		FlexSPI_ClockDiv = 3;	// ~Double the Frequency in DDR-Mode
		FlexSPI_Clock_Hz = SourceClock_Hz / FlexSPI_ClockDiv;
		deviceconfig.flexspiRootClk = FlexSPI_Clock_Hz;
		SetClockConfig (base, FlexSPI_ClockDiv); // Divide source clock the source/root ratio // Divide source clock the source/root ratio --> 148,5 Mhz
	}

	if (lut != NULL)
		// Update the LUT
		FLEXSPI_UpdateLUT (base, 0, lut, CUSTOM_LUT_LENGTH);

