Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.c
	FLEXSPI_SoftwareReset (base);
	status_t stat = WaitBusBusy (base);
	if (stat != kStatus_Success)
		return LIBMEM_STATUS_ERROR;


	static uint8_t write_buffer[QSPIFLASH_PAGE_SIZE];
//	libmem_register_driver (FlashHandle, (uint8_t *)libmem_GetBaseAddress(base), FlashSize, geometry, 0, &DriverFunctions, &DriverFunctions_Extended);
	libmem_register_driver (FlashHandle, (uint8_t *)libmem_GetBaseAddress(base), FlashSize, geometry, 0, &DriverFunctions, NULL);
	FlashHandle->user_data = (uint32_t)base;
	return libmem_driver_paged_write_init (&paged_write_ctrlblk, write_buffer, QSPIFLASH_PAGE_SIZE, ProgramPage, 4, LIBMEM_DRIVER_PAGED_WRITE_OPTION_DISABLE_PAGE_PRELOAD);
}


static status_t UnprotectAll_Adesto (FLEXSPI_Type *base)
{
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return stat;

	// write 0 to status/control register 1 - this will unprotect all sectors
	stat = WriteRegister (base, 1, 0, LUT_WriteStatusReg_Adesto);
	if (stat != kStatus_Success)
		return stat;

	return WaitBusBusy (base);
}

static status_t ReadJEDEC (FLEXSPI_Type *base, struct DeviceInfo *Info)
{
	uint8_t Identification[16] = { 0U };

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadJEDEC_ID;
	flashXfer.data          = (uint32_t *)Identification;
	flashXfer.dataSize      = sizeof(Identification);

	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);

	if (status == kStatus_Success)
	{
		if (Identification[0] == 0 || Identification[0] == 0xFF)
			return kStatus_Fail;	// got no ID-Code: No Flash available

		int i=0;
		for (; i<8; i++)
		{
			if (Identification[i] != ManufactureID_NEXT_MARKER)
				break;
		}

		Info->ManufactureID = (enum SerialFlash_ManufactureID)(((i+1)<<8) | Identification[i]);
		Info->Type          = Identification[i+1];
		switch (Info->ManufactureID)
		{
			case ManufactureID_AdestoTechnologies:
				switch (Info->Type & 0x1F)
				{
					case 0x06:
						Info->Capacity = Capacity_16MBit;
						break;
					case 0x07:
						Info->Capacity = Capacity_32MBit;
						break;
					case 0x08:
						Info->Capacity = Capacity_64MBit;
						break;
					case 0x09:
						Info->Capacity = Capacity_128MBit;
						break;
				}
				break;
			case ManufactureID_Macronix:
				Info->Capacity = (enum Capacity)(Identification[i+2] & 0x1F);
				break;
			case ManufactureID_Atmel:
				if (Info->Type == 0x89)	// AT25SF128A
				{
					Info->Capacity = Capacity_128MBit;
					break;
				}
				// fall through
			default:
				Info->Capacity = (enum Capacity)Identification[i+2];
		}
	}

	return status;
}

/** WriteEnable:
Send write-enable command
@param base The Flex-SPI-base to use
@param baseAddr The base-address of the command
@return static status_t */
static status_t WriteEnable (FLEXSPI_Type *base, uint32_t baseAddr)
{
	flexspi_transfer_t flashXfer;

	// Write enable
	flashXfer.deviceAddress = baseAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_WriteEnable;
	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);

	return status;
}

static status_t EnterQuadSPIMode (FLEXSPI_Type *base, uint32_t baseAddr, enum LUT_CommandOffsets LutOffset)
{
	flexspi_transfer_t flashXfer;

	// Write enable
	flashXfer.deviceAddress = baseAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LutOffset;
	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);

	return status;
}


/** WaitBusBusy:
Wait until the Write/erase operation is finished and the Flash is not busy anymore
@param base The Flex-SPI-base to use
@return status_t kStatus_Success if the operation was successfully */
static status_t WaitBusBusy (FLEXSPI_Type *base)
{
	// Wait status ready.
	bool isBusy;
	uint32_t readValue;
	status_t status;

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadStatus;
	flashXfer.data          = &readValue;
	flashXfer.dataSize      = 1;

	do
	{
		status = FLEXSPI_TransferBlocking (base, &flashXfer);

		if (status != kStatus_Success)
			return status;

		isBusy = (readValue & 1U);
	}
	while (isBusy);

	return status;
}


static status_t WriteRegister (FLEXSPI_Type *base, uint32_t Address, uint8_t value, enum LUT_CommandOffsets cmd)
{
	uint32_t Buffer = value;

	flexspi_transfer_t flashXfer;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Write;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = cmd;
	flashXfer.deviceAddress = Address;
	flashXfer.data          = &Buffer;
	flashXfer.dataSize      = 1;
	return FLEXSPI_TransferBlocking (base, &flashXfer);
}

static status_t ReadStatusRegister (FLEXSPI_Type *base, uint8_t Address, uint8_t *value)
{
	flexspi_transfer_t flashXfer;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadStatus;
	flashXfer.deviceAddress = Address;
	flashXfer.data          = (uint32_t *)value;
	flashXfer.dataSize      = 1;
	return FLEXSPI_TransferBlocking (base, &flashXfer);
}


/** EraseChip:
Erase the whole-Flash-memory
@param base The FlexSPI-Interface where the Flash is located which should be erased
@return static status_t Status of the Operation - kStatus_Success when successfully */
static status_t EraseChip (FLEXSPI_Type *base)
{
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return stat;

	flexspi_transfer_t flashXfer;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.SeqNumber     = 1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.seqIndex      = LUT_EraseChip;
	flashXfer.deviceAddress = 0;
	//flashXfer.data = &flash_status;
	//flashXfer.dataSize = 1;
	stat = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (stat != kStatus_Success)
		return stat;

	return WaitBusBusy (base);
}

/** EraseSector:
Erase a sector of the Flash-Memory
@param h Handle to the Flash-Driver
@param si Information about the sector which should be erased
@return static int LIBMEM_STATUS_SUCCESS when the erase operation was successfully, otherwise LIBMEM_STATUS_ERROR */
static int EraseSector (libmem_driver_handle_t *h, libmem_sector_info_t *si)
{
	FLEXSPI_Type *base = (FLEXSPI_Type *)h->user_data;
	uint32_t SectorAddr = libmem_CalculateOffset (base, (uint32_t)si->start);
	if (SectorAddr == UINT32_MAX)
		return LIBMEM_STATUS_ERROR;

	DebugPrintf ("EraseSector at 0x%x, size: %d\r\n", SectorAddr, si->size);

	status_t status = WriteEnable (base, SectorAddr);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = SectorAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_EraseSector;
	status = FLEXSPI_TransferBlocking (base, &flashXfer);

	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	status = WaitBusBusy (base);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

